base-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         800;

deltaT          1;

writeControl    timeStep;

writeInterval   200;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forceCoeffs
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        patches         (discWall);
        rho             rhoInf;
        rhoInf          1.225;  // Air density
        CofR            (1.05 0 0);  // Center of disc
        liftDir         (0 1 0);  // Adjust for AoA if needed
        dragDir         (1 0 0);
        pitchAxis       (0 0 1);
        magUInf         26.9;
        lRef            0.21;  // Disc diameter
        Aref            0.0346;  // pi*(D/2)^2
        writeControl    timeStep;
        writeInterval   200;
    }
}
