base-case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    disc.stl
    {
        type triSurfaceMesh;
        name disc;
        regions
        {
            zone0 { name discWall; }
        }
    }
    refinementBox
    {
        type searchableBox;
        min (0.84  -0.42  -0.42);  // Box around disc at x=1.05, ±2D extent
        max (1.26   0.42   0.42);
    }
};

castellatedMeshControls
{
    maxLocalCells 1000000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 4;

    features
    (
        { file "disc.eMesh"; level 3; }
    );

    refinementSurfaces
    {
        disc
        {
            level (4 5);
            patchInfo
            {
                type wall;
            }
        }
    }

    refinementRegions
    {
        refinementBox
        {
            mode inside;
            levels ((1E15 5));  // 7 refinement levels per article
        }
    }

    resolveFeatureAngle 150;

    locationInMesh (2.5 0 0);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes true;
    layers
    {
        discWall
        {
            nSurfaceLayers 10;  // Reduced to 10 for stability (was 15)
        }
    }
    expansionRatio 1.2;
    finalLayerThickness 1e-4;  // Increased to 0.1 mm (was 2e-5)
    minThickness 1e-5;  // Increased to 10 µm (was 1e-6)
    nGrow 0;
    featureAngle 130;
    slipFeatureAngle 30;
    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;  // Added for displacementMedialAxis
    minMedialAxisAngle 90;  // Added to fix error
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minVol 1e-13;
    minTetQuality -1e-9;
    minArea -1e-6;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance 1e-6;

// ************************************************************************* //
